Revit 2024 API
LoadCase.IsLoadNatureId Method
 Checks whether provided element ID refer to LoadNature element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsLoadNatureId(
	ElementId natureId
)
Visual Basic
Public Function IsLoadNatureId ( _
	natureId As ElementId _
) As Boolean
Visual C++
public:
bool IsLoadNatureId(
	ElementId^ natureId
)
Parameters
natureId
Type: Autodesk.Revit.DB.ElementId
 The ID to check.
Return Value
 True if the ID refers to LoadNature element, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace